STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/lpbam/sens_acquisition.c
/**
  ******************************************************************************
  * @file    sens_acquisition.c
  * @author  MCD Application Team
  * @brief   Sensor acquisition implementation
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "stm32u5xx_hal.h"
#include "main.h"
#include "app_lpbam.h"
#include "sens_acquisition.h"
#include "stm32_lpbam.h"

/* Private typedef ----------------------------------------------------------*/

/* Private constants ----------------------------------------------------------*/
/* Private Variables ---------------------------------------------------------*/
/* Used to exit application */
static __IO uint8_t UserEvent=0;
static __IO uint8_t UserEntry=0;
static uint32_t count=0;;

DMA_HandleTypeDef        DMAHandle1;
DMA_HandleTypeDef        DMAHandle2;

extern LPTIM_HandleTypeDef LPTIMHandle;
extern I2C_HandleTypeDef hbus_i2c3;

I2C_AutonomousModeConfTypeDef AutonomousModeConf;

/* LPBAM variables declaration */
static LPBAM_DMAListInfo_t     DMAListInfo;
LPBAM_I2C_DataAdvConf_t        I2C_DataAdvConf;

/* Place following data in section  SDRAM4 LPBAM_Section */
#if defined ( __ICCARM__ )
#pragma default_variable_attributes =@".LPBAM_Section"

DMA_QListTypeDef               I2C_TransmitQueue[4];
LPBAM_I2C_MasterTxDataDesc_t   MasterTxDataDesc;
LPBAM_I2C_MasterRxDataDesc_t   MasterRxDataDesc;
uint8_t                        tmp_Reg [4];
uint8_t                        tmp_pData [6];
int16_t                        x [140];
int16_t                        y [140];
int16_t                        z [140];
DMA_NodeConfTypeDef            dmaNodeConf;
DMA_NodeTypeDef                pNode0;
DMA_NodeTypeDef                pNode1;
DMA_NodeTypeDef                pNode2;

/* Stop placing functions in section SDRAM4 LPBAM_Sectionn */
#pragma default_variable_attributes =
#endif

#if defined ( __CC_ARM )||( __GNUC__ )
DMA_QListTypeDef               I2C_TransmitQueue[4] __attribute__((section(".LPBAM_Section"))) ;
LPBAM_I2C_MasterTxDataDesc_t   MasterTxDataDesc __attribute__((section(".LPBAM_Section"))) ;
LPBAM_I2C_MasterRxDataDesc_t   MasterRxDataDesc __attribute__((section(".LPBAM_Section"))) ;
uint8_t                        tmp_Reg [4] __attribute__((section(".LPBAM_Section"))) ;
uint8_t                        tmp_pData [6] __attribute__((section(".LPBAM_Section"))) ;
int16_t                        x [140] __attribute__((section(".LPBAM_Section"))) ;
int16_t                        y [140] __attribute__((section(".LPBAM_Section"))) ;
int16_t                        z [140] __attribute__((section(".LPBAM_Section"))) ;
DMA_NodeConfTypeDef            dmaNodeConf __attribute__((section(".LPBAM_Section"))) ;
DMA_NodeTypeDef                pNode0  __attribute__((section(".LPBAM_Section")));
DMA_NodeTypeDef                pNode1  __attribute__((section(".LPBAM_Section")));
DMA_NodeTypeDef                pNode2 __attribute__((section(".LPBAM_Section")));
#endif


/* Private functions --------------------------------------------------------*/
static void EnterLowPowerMode(void);
static void Sensors_Aquisition(void);
static void Show_Results(void);
static void LPTIM_Config (void);
static void DMA_LinkedListConfig (void);
/* Private typedef -----------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
void Sens_Acquisition_Demo(void)
{
    uint32_t joyState = JOY_NONE;
    uint32_t Button   = 0;
  /* IMPLEMENT APPLICATION HERE */
  
  UTIL_LCD_SetFont(&Font24);
  UTIL_LCD_Clear(UTIL_LCD_COLOR_ST_GRAY_DARK);
  
  UTIL_LCD_FillRect(0, 0, 320, 24,UTIL_LCD_COLOR_ST_BLUE_DARK);
  
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  
  UTIL_LCD_DisplayStringAt(0, 0, (uint8_t *)"Sensor Acquisition", CENTER_MODE);
  
  /* Guide Panel */
  UTIL_LCD_FillRect(2, 30, 316, 184,UTIL_LCD_COLOR_WHITE);    
  
  UTIL_LCD_SetFont(&Font16);  
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_PURPLE);
  UTIL_LCD_DisplayStringAt(4, 60, (uint8_t *)"Autonomous Motion Sensor ", CENTER_MODE);
  UTIL_LCD_DisplayStringAt(4, 80, (uint8_t *)"Acquisition and Data Saving ", CENTER_MODE);
  UTIL_LCD_DisplayStringAt(4, 100, (uint8_t *)"to Internal Memory", CENTER_MODE);
  UTIL_LCD_DisplayStringAt(4, 120, (uint8_t *)"in Stop Mode", CENTER_MODE);
  
  UTIL_LCD_DisplayStringAt(4, 140, (uint8_t *)"* Pls Move the Board * ", CENTER_MODE);
  
  UTIL_LCD_SetFont(&Font12);  
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_MAGENTA);
  
  UTIL_LCD_DisplayStringAt(4, 170, (uint8_t *)"(Use Joystick for wakeup)", CENTER_MODE);
  
  UTIL_LCD_DrawRect(66, 186, 194, 26,UTIL_LCD_COLOR_RED);
  UTIL_LCD_DrawRect(65, 185, 196, 28,UTIL_LCD_COLOR_RED);
  UTIL_LCD_FillRect(67, 187, 192, 24,UTIL_LCD_COLOR_ST_YELLOW);
  UTIL_LCD_FillRect(68, 188, 190, 22,UTIL_LCD_COLOR_BLACK);
  
  UTIL_LCD_SetFont(&Font16); 
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_BLACK);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_YELLOW);
  UTIL_LCD_DisplayStringAt(4, 192, (uint8_t *)"Start Acquisition", CENTER_MODE); 
  
  /* Log Panel */
  UTIL_LCD_FillRect(2, 220, 316, 18,UTIL_LCD_COLOR_WHITE);    
  
  UTIL_LCD_SetFont(&Font16);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GREEN);
  
  UTIL_LCD_DisplayStringAt(40, 222, (uint8_t *)"System in Run mode ", LEFT_MODE);
  
  /* Return button */  
  UTIL_LCD_DrawRect(280, 220, 40, 18,UTIL_LCD_COLOR_BLACK);
  UTIL_LCD_FillRect(281, 221, 38, 16,UTIL_LCD_COLOR_ST_YELLOW); 
  UTIL_LCD_FillRect(282, 222, 36, 14,UTIL_LCD_COLOR_BLACK);  
  
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_BLACK);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_YELLOW);
  UTIL_LCD_DisplayStringAt(286, 224, (uint8_t *)"BCK", LEFT_MODE);  
  
  
  
  do 
  {

    joyState = JOY_NONE;
    while (joyState == JOY_NONE)
    {  
      joyState = BSP_JOY_GetState(JOY1);
      
