STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/lpbam/sens_acquisition.c
      UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_MAGENTA);
      
      if (count%4 == 0)
      {
        UTIL_LCD_DisplayStringAt(20, 222, (uint8_t *) "/", LEFT_MODE);      
        UTIL_LCD_DisplayStringAt(260, 222, (uint8_t *) "/", LEFT_MODE);      
        
      }
      if (count%4 == 1)
      {
        UTIL_LCD_DisplayStringAt(20, 222, (uint8_t *) "-", LEFT_MODE);      
        UTIL_LCD_DisplayStringAt(260, 222, (uint8_t *) "-", LEFT_MODE);      
      }
      if (count%4 == 2)
      {
        UTIL_LCD_DisplayStringAt(20, 222, (uint8_t *) "\\", LEFT_MODE);      
        UTIL_LCD_DisplayStringAt(260, 222, (uint8_t *) "\\", LEFT_MODE);      
        
      }
      if (count%4 == 3)
      {
        UTIL_LCD_DisplayStringAt(20, 222, (uint8_t *) "|", LEFT_MODE);      
        UTIL_LCD_DisplayStringAt(260, 222, (uint8_t *) "|", LEFT_MODE);      
      }
      
      
      count++;
      HAL_Delay(200);
      
    }
    
    /* anti bounding assert */ 
    while (BSP_JOY_GetState(JOY1) != JOY_NONE);
    HAL_Delay(100);

    if ( joyState != JOY_SEL)
    {    
      if (Button == 0)
      {
        Button =1;
        
        UTIL_LCD_DrawRect(66, 186, 194, 26,UTIL_LCD_COLOR_BLACK);
        UTIL_LCD_DrawRect(65, 185, 196, 28,UTIL_LCD_COLOR_WHITE);
        UTIL_LCD_DrawRect(280, 220, 40, 18,UTIL_LCD_COLOR_RED);
        UTIL_LCD_DrawRect(279, 219, 41, 20,UTIL_LCD_COLOR_RED);
      }
      else
      {
        Button =0;
        UTIL_LCD_DrawRect(280, 220, 40, 18,UTIL_LCD_COLOR_BLACK);
        UTIL_LCD_DrawRect(279, 219, 41, 20,UTIL_LCD_COLOR_WHITE);
        UTIL_LCD_DrawRect(66, 186, 194, 26,UTIL_LCD_COLOR_RED);
        UTIL_LCD_DrawRect(65, 185, 196, 28,UTIL_LCD_COLOR_RED);
      }
    }
 
    
    if (joyState == JOY_SEL) 
    {
      
      if (Button == 0)
      {
        
        UTIL_LCD_SetFont(&Font16);
        UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_RED);
        UTIL_LCD_DisplayStringAt(40, 222, (uint8_t *)"System in Stop mode ", LEFT_MODE);
        
        Sensors_Aquisition();     
        HAL_Delay(100);
        EnterLowPowerMode(); 
        
        Show_Results();
        HAL_Delay(10);
        HAL_NVIC_SystemReset();
      }
      else
      {
        break;
      }
    }
 
    
  } while (1); 
  

}


static void Sensors_Aquisition(void)
{
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};
  
  /* Re-target the HSI to Clock the I2C3 peripheral */
  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_I2C3;
  RCC_PeriphCLKInitStruct.I2c3ClockSelection = RCC_I2C3CLKSOURCE_HSI;
  /* Initialize the RCC extended peripherals clocks */
  if (HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct) != HAL_OK)
  {
    Error_Handler();
  }    
  
  
  
  
  if (BSP_MOTION_SENSOR_Init(0, MOTION_ACCELERO) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }  
  
  /* Enable function */
  if (BSP_MOTION_SENSOR_Enable(0, MOTION_ACCELERO) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }
  
  HAL_Delay(100);
  
  
  memset(I2C_TransmitQueue, 0x0, sizeof(I2C_TransmitQueue));
  memset(x, 0x0, sizeof(x)); 
  memset(y, 0x0, sizeof(y)); 
  memset(z, 0x0, sizeof(z)); 
  
  tmp_Reg[0] = LSM6DSO_OUTX_L_A;
  /* ************************************************************************ */
  /* Read Axes x, y, z from Gyroscope *****************************************/
  /* ************************************************************************ */
  
  /* Set Autonomous Mode configuration */
  AutonomousModeConf.TriggerState     = I2C_AUTO_MODE_ENABLE;
  AutonomousModeConf.TriggerPolarity  = I2C_TRIG_POLARITY_RISING;
  AutonomousModeConf.TriggerSelection = I2C_GRP2_LPTIM3_CH1_TRG;
  if (HAL_I2CEx_SetConfigAutonomousMode(&hbus_i2c3, &AutonomousModeConf) != HAL_OK)
  {
    Error_Handler();
  }


  /* Enable errors interrupt */
  __HAL_I2C_ENABLE_IT(&hbus_i2c3, I2C_IT_ERRI);

  /* Enable DMA request */
  if (ADV_LPBAM_I2C_EnableDMARequests(hbus_i2c3.Instance) != LPBAM_OK)
  {
    Error_Handler();
  }

  /* Sequence 1 : Transmit in master mode  Sensor register address (LSM6DSO_OUTX_L_A)  */
  /* Set queue type */
 
  DMAListInfo.QueueType                           = LPBAM_LINEAR_ADDRESSING_Q;

  /* Set transfer information */
  I2C_DataAdvConf.DevAddress                      = LSM6DSO_I2C_ADD_L;
  I2C_DataAdvConf.SequenceNumber                  = 4U;
  I2C_DataAdvConf.AddressingMode                  = LPBAM_I2C_ADDRESSINGMODE_7BIT;
  I2C_DataAdvConf.Size                            = I2C_MEMADD_SIZE_8BIT;
  I2C_DataAdvConf.pData                           = (uint8_t *)&tmp_Reg;
  I2C_DataAdvConf.AutoModeConf.TriggerState       = LPBAM_I2C_AUTO_MODE_ENABLE;

  /* Advanced lpbam I2C master transmit set data */
  if (ADV_LPBAM_I2C_MasterTx_SetDataQ(I2C3, &DMAListInfo, &I2C_DataAdvConf, &MasterTxDataDesc, &I2C_TransmitQueue[0]) != LPBAM_OK)
  {
    Error_Handler();
  }  
  
  /* Set transfer information */
  I2C_DataAdvConf.Size  = 6;
  I2C_DataAdvConf.pData = (uint8_t *)&tmp_pData;

  /* Advanced lpbam I2C master receive set data*/
  if (ADV_LPBAM_I2C_MasterRx_SetDataQ(I2C3, &DMAListInfo, &I2C_DataAdvConf, &MasterRxDataDesc, &I2C_TransmitQueue[0]) != LPBAM_OK)
  {
    Error_Handler();
  }

  /* Set the circular mode */
  HAL_DMAEx_List_SetCircularMode (&I2C_TransmitQueue[0]);
  
  /* DMA linked-list configuration */
  DMA_LinkedListConfig();  
  

  /* ************************************************************************ */
  /* Get Axe x ****************************************************************/
  /* ************************************************************************ */
  /* Set Node0 type */
  dmaNodeConf.NodeType                            = DMA_LPDMA_LINEAR_NODE;
  
  /* Set common node parameters */
  dmaNodeConf.Init.Request                        = DMA_REQUEST_SW;
  dmaNodeConf.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
  dmaNodeConf.Init.Direction                      = DMA_MEMORY_TO_MEMORY;
  dmaNodeConf.Init.SrcInc                         = DMA_SINC_FIXED;
  dmaNodeConf.Init.DestInc                        = DMA_DINC_INCREMENTED;
  dmaNodeConf.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_HALFWORD;
  dmaNodeConf.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_HALFWORD;
  dmaNodeConf.Init.TransferEventMode              = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
  
  dmaNodeConf.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
  
  /* Set node trigger parameters */
  dmaNodeConf.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_RISING;
  dmaNodeConf.TriggerConfig.TriggerMode           = DMA_TRIGM_SINGLE_BURST_TRANSFER;
  dmaNodeConf.TriggerConfig.TriggerSelection      = LPDMA1_TRIGGER_LPTIM3_CH1;
  
  dmaNodeConf.SrcAddress = (int32_t)&tmp_pData;
  dmaNodeConf.DstAddress = (int32_t)&x;
  dmaNodeConf.DataSize   = 2*140;
  
