STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/lpbam/sens_acquisition.c
  /* Build enable node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConf, &pNode0) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Insert enable node to I2C_TransmitQueue */
  if (HAL_DMAEx_List_InsertNode_Tail(&I2C_TransmitQueue[1], &pNode0) != HAL_OK)
  {
    Error_Handler();
  }
  
  /*Configure LPDMA1 Channel1 */
  DMAHandle2.Instance                         = LPDMA1_Channel1;
  
  /* Set parameters to be configured */
  DMAHandle2.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
  DMAHandle2.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
  DMAHandle2.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
  DMAHandle2.InitLinkedList.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  DMAHandle2.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_NORMAL;
  
  /* Initialize DMA linked list */
  if (HAL_DMAEx_List_Init(&DMAHandle2) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Link queue to channel DMA */
  if (HAL_DMAEx_List_LinkQ(&DMAHandle2, &I2C_TransmitQueue[1]) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Configure the NVIC for LPDMA1 Channel 1 */
  HAL_NVIC_SetPriority(LPDMA1_Channel1_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(LPDMA1_Channel1_IRQn);
  
  /* Set the circular mode */
  HAL_DMAEx_List_SetCircularMode (&I2C_TransmitQueue[1]);
  
  /* Start DMA linked list in interrupt mode */
  if (HAL_DMAEx_List_Start(&DMAHandle2) != HAL_OK)
  {
    Error_Handler();
  }
  
  
  /* ************************************************************************ */
  /* Get Axe Y ****************************************************************/
  /* ************************************************************************ */
  /* Set Node1 type */
  dmaNodeConf.NodeType                            = DMA_LPDMA_LINEAR_NODE;
  
  /* Set common node parameters */
  dmaNodeConf.Init.Request                        = DMA_REQUEST_SW;
  dmaNodeConf.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
  dmaNodeConf.Init.Direction                      = DMA_MEMORY_TO_MEMORY;
  dmaNodeConf.Init.SrcInc                         = DMA_SINC_FIXED;
  dmaNodeConf.Init.DestInc                        = DMA_DINC_INCREMENTED;
  dmaNodeConf.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_HALFWORD;
  dmaNodeConf.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_HALFWORD;
  dmaNodeConf.Init.TransferEventMode              = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
  
  dmaNodeConf.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
  
  /* Set node trigger parameters */
  dmaNodeConf.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_RISING;
  dmaNodeConf.TriggerConfig.TriggerMode           = DMA_TRIGM_SINGLE_BURST_TRANSFER;
  dmaNodeConf.TriggerConfig.TriggerSelection      = LPDMA1_TRIGGER_LPTIM3_CH1;
  
  dmaNodeConf.SrcAddress = (int32_t)&tmp_pData[2];
  dmaNodeConf.DstAddress = (int32_t)&y;
  dmaNodeConf.DataSize   = 2*140;
  
  /* Build enable node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConf, &pNode1) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Insert enable node I2C_TransmitQueue */
  if (HAL_DMAEx_List_InsertNode_Tail(&I2C_TransmitQueue[2], &pNode1) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Configure LPDMA1 Channel2 */
  DMAHandle2.Instance                         = LPDMA1_Channel2;
  
  /* Set parameters to be configured */
  DMAHandle2.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
  DMAHandle2.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
  DMAHandle2.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
  DMAHandle2.InitLinkedList.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  DMAHandle2.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_NORMAL;
  
  /* Initialize DMA linked list */
  if (HAL_DMAEx_List_Init(&DMAHandle2) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Link queue to channel DMA */
  if (HAL_DMAEx_List_LinkQ(&DMAHandle2, &I2C_TransmitQueue[2]) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Configure the NVIC for LPDMA1 Channel 2 */
  HAL_NVIC_SetPriority(LPDMA1_Channel2_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(LPDMA1_Channel2_IRQn);
  
  /* Set the circular mode */
  HAL_DMAEx_List_SetCircularMode (&I2C_TransmitQueue[2]);
  
  /* Start DMA linked list in interrupt mode */
  if (HAL_DMAEx_List_Start(&DMAHandle2) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* ************************************************************************ */
  /* Get Axe Z ****************************************************************/
  /* ************************************************************************ */
  /* Set Node2 type */
  dmaNodeConf.NodeType                            = DMA_LPDMA_LINEAR_NODE;
  
  /* Set common node parameters */
  dmaNodeConf.Init.Request                        = DMA_REQUEST_SW;
  dmaNodeConf.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
  dmaNodeConf.Init.Direction                      = DMA_MEMORY_TO_MEMORY;
  dmaNodeConf.Init.SrcInc                         = DMA_SINC_FIXED;
  dmaNodeConf.Init.DestInc                        = DMA_DINC_INCREMENTED;
  dmaNodeConf.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_HALFWORD;
  dmaNodeConf.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_HALFWORD;
  dmaNodeConf.Init.TransferEventMode              = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
  
  dmaNodeConf.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
  
  /* Set node trigger parameters */
  dmaNodeConf.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_RISING;
  dmaNodeConf.TriggerConfig.TriggerMode           = DMA_TRIGM_SINGLE_BURST_TRANSFER;
  dmaNodeConf.TriggerConfig.TriggerSelection      = LPDMA1_TRIGGER_LPTIM3_CH1;
  
  dmaNodeConf.SrcAddress = (int32_t)&tmp_pData[4];
  dmaNodeConf.DstAddress = (int32_t)&z;
  dmaNodeConf.DataSize   = 2*140;
  
  /* Build enable node */
  if (HAL_DMAEx_List_BuildNode(&dmaNodeConf, &pNode2) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Insert enable node to I2C_TransmitQueue */
  if (HAL_DMAEx_List_InsertNode_Tail(&I2C_TransmitQueue[3], &pNode2) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Configure LPDMA1 Channel3 */
  DMAHandle2.Instance                         = LPDMA1_Channel3;
  
  /* Set parameters to be configured */
  DMAHandle2.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
  DMAHandle2.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
  DMAHandle2.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
  DMAHandle2.InitLinkedList.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  DMAHandle2.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_NORMAL;
  
  /* Initialize DMA linked list */
  if (HAL_DMAEx_List_Init(&DMAHandle2) != HAL_OK)
  {
    Error_Handler();
  }
  
