STMicroelectronics/STM32CubeU5/Projects/STM32U575I-EV/Demonstrations/Modules/lpbam/sens_acquisition.c
  /* Link queue to channel DMA */
  if (HAL_DMAEx_List_LinkQ(&DMAHandle2, &I2C_TransmitQueue[3]) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Configure the NVIC for LPDMA1 Channel 3 */
  HAL_NVIC_SetPriority(LPDMA1_Channel3_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(LPDMA1_Channel3_IRQn);
  
  HAL_DMAEx_List_SetCircularMode (&I2C_TransmitQueue[3]);
  
  /* Start DMA linked list in interrupt mode */
  if (HAL_DMAEx_List_Start(&DMAHandle2) != HAL_OK)
  {
    Error_Handler();
  }
  
  LPTIM_Config();
  
  
}



void Show_Results(void)
{
  uint32_t joyState = JOY_NONE;

  
  if (HAL_LPTIM_PWM_Stop(&LPTIMHandle, LPTIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
  /* Results Panel */
  UTIL_LCD_FillRect(2, 30, 316, 210,UTIL_LCD_COLOR_WHITE);    
  
  UTIL_LCD_SetFont(&Font12);  
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_RED);
  UTIL_LCD_DisplayStringAt(20, 40, (uint8_t *)"X ", LEFT_MODE);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GREEN);
  UTIL_LCD_DisplayStringAt(20, 52, (uint8_t *)"Y ", LEFT_MODE);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_BLUE);
  UTIL_LCD_DisplayStringAt(20, 64, (uint8_t *)"Z ", LEFT_MODE);
  
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  
  UTIL_LCD_DisplayStringAt(280, 124, (uint8_t *)"Time", LEFT_MODE);
  
  UTIL_LCD_DrawLine(20, 120, 280,120,UTIL_LCD_COLOR_BLACK);
  UTIL_LCD_DrawLine(30, 40, 30,210,UTIL_LCD_COLOR_BLACK);
  
  UTIL_LCD_SetFont(&Font12);  
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_MAGENTA);
  
  /* Return button */  
  UTIL_LCD_DrawRect(280, 220, 40, 18,UTIL_LCD_COLOR_RED);
  UTIL_LCD_FillRect(281, 221, 38, 16,UTIL_LCD_COLOR_ST_YELLOW); 
  UTIL_LCD_FillRect(282, 222, 36, 14,UTIL_LCD_COLOR_BLACK);  
  
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_BLACK);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_YELLOW);
  UTIL_LCD_DisplayStringAt(286, 224, (uint8_t *)"BCK", LEFT_MODE);  
  
  
  
  for(int i=0;i<140;i++)
  {
    x[i] = (int16_t) ( x[i]*LSM6DSO_ACC_SENSITIVITY_FS_2G/20 );
    y[i] = (int16_t) ( y[i]*LSM6DSO_ACC_SENSITIVITY_FS_2G/20);
    
    z[i] = (int16_t) ( z[i]*LSM6DSO_ACC_SENSITIVITY_FS_2G/20); 
    
    
  }
  
  for(int i=0;i<140-1;i++)
  {
    
    UTIL_LCD_DrawLine(30+ 2*i, 120-x[i], 30+ 2*(i+1), 120-x[i+1], UTIL_LCD_COLOR_RED);
    UTIL_LCD_DrawLine(30+ 2*i, 120-y[i], 30+ 2*(i+1), 120-y[i+1], UTIL_LCD_COLOR_GREEN);
    UTIL_LCD_DrawLine(30+ 2*i, 120-z[i], 30+ 2*(i+1), 120-z[i+1], UTIL_LCD_COLOR_BLUE);    
  }
  
  

  HAL_Delay(200); 
  
  while( joyState == JOY_NONE)
  {
    joyState = BSP_JOY_GetState(JOY1);
  }
  /* anti bounding assert */ 
  while( BSP_JOY_GetState(JOY1) != JOY_NONE);
  
  
}

/**
* @brief  Enter low power mode
* @param  None
* @retval None
*/
static void EnterLowPowerMode(void)
{
  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* Enter the system to STOP mode */
  HAL_PWREx_EnterSTOP1Mode(PWR_STOPENTRY_WFI);

}

/**
* @brief  LPTIM configuration.
* @param  None
* @retval None
*/
static void LPTIM_Config (void)
{
  LPTIM_OC_ConfigTypeDef sConfig;
  

  uint32_t Period = 0x4ff;

  uint32_t Pulse  = Period / 2U;
  
  /* Set lptim instance */
  LPTIMHandle.Instance = LPTIM3;
  
  /* Set parameters to be configured */
  LPTIMHandle.Init.CounterSource                 = LPTIM_COUNTERSOURCE_INTERNAL;
  LPTIMHandle.Init.UpdateMode                    = LPTIM_UPDATE_IMMEDIATE;
  LPTIMHandle.Init.Clock.Source                  = LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC;
  LPTIMHandle.Init.Clock.Prescaler               = LPTIM_PRESCALER_DIV1;
  LPTIMHandle.Init.UltraLowPowerClock.Polarity   = LPTIM_CLOCKPOLARITY_RISING;
  LPTIMHandle.Init.UltraLowPowerClock.SampleTime = LPTIM_CLOCKSAMPLETIME_DIRECTTRANSITION;
  LPTIMHandle.Init.Trigger.Source                = LPTIM_TRIGSOURCE_SOFTWARE;
  LPTIMHandle.Init.Trigger.ActiveEdge            = LPTIM_ACTIVEEDGE_RISING;
  LPTIMHandle.Init.Trigger.SampleTime            = LPTIM_TRIGSAMPLETIME_DIRECTTRANSITION;
  LPTIMHandle.Init.Input1Source                  = LPTIM_INPUT1SOURCE_GPIO;
  LPTIMHandle.Init.Input2Source                  = LPTIM_INPUT2SOURCE_GPIO;
  LPTIMHandle.Init.Period                        = Period;
  LPTIMHandle.Init.RepetitionCounter             = 1;
  
  /* Initialize LPTIM peripheral according to the specified parameters */
  if (HAL_LPTIM_Init (&LPTIMHandle) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Select parameters to be configured */
  sConfig.Pulse      = Pulse;
  sConfig.OCPolarity = LPTIM_OCPOLARITY_HIGH;
  
  /* Configure the current channel */
  if (HAL_LPTIM_OC_ConfigChannel (&LPTIMHandle, &sConfig, LPTIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Generate one pulse : LPTIM_OUT is used to trig the DMA in order to start
  transactions                                                             */
  if (HAL_LPTIM_PWM_Start(&LPTIMHandle, LPTIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief  I2C DMA Linked list  configuration.
  * @param  None
  * @retval None
  */
static void DMA_LinkedListConfig (void)
{
  /* Set DMA instance */
  DMAHandle1.Instance                         = LPDMA1_Channel0;

  /* Set parameters to be configured */
  DMAHandle1.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
  DMAHandle1.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
  DMAHandle1.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
  DMAHandle1.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
  DMAHandle1.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

  /* Initialize DMA linked list */
  if (HAL_DMAEx_List_Init(&DMAHandle1) != HAL_OK)
  {
    Error_Handler();
  }

  /* Link queue to channel DMA */
  if (HAL_DMAEx_List_LinkQ(&DMAHandle1, &I2C_TransmitQueue[0]) != HAL_OK)
  {
    Error_Handler();
  }

  /* Configure the NVIC for LPDMA1 Channel 0 */
  HAL_NVIC_SetPriority(LPDMA1_Channel0_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(LPDMA1_Channel0_IRQn);

  /* Start DMA linked list in interrupt mode */
  if (HAL_DMAEx_List_Start_IT(&DMAHandle1) != HAL_OK)
  {
    Error_Handler();
  }
}
/**
* @brief  Get User action
* @param  sel User selection (JOY_SEL,...)
* @note   This example is the only way to get user information.
* @retval None
*/
void Sens_Acquisition_UserAction(uint8_t sel)
{
  UserEvent = sel;
  UserEntry = 1;
}
